import React from "react";
import "./converters.css";
import Converter from "../Converter/Converter";
import items from "../../data/items.json";

function Converters() {
  const converters = items.data;

  return (
    <div>
      <div className="section-title">
        <h3>Конвертери та перетворювачі напруги</h3>
      </div>
      <div className="description">
        Аварійне джерело живлення sinusPRO 500 E 12V - це пристрій для
        безперебійного живлення, серед іншого: пристриї центрального опалення
        (котли індивідуального опалення, насоси, контролери, блок живлення
        тощо), комп’ютери, сервери, автоматичні ворота, пристрої автоматики,
        електроінструментів і т. д. У разі відключення електроенергії мережі 230
        В змінного струму, пристрій переходить в режим роботи з акумуляторної
        батареї, що дозволяє далі безперебійної роботи системі та запобігає
        пошкодженню інсталяції, безповоротній втраті даних тощо. Даний пристрій
        містить такі функції: - Чистий синусоїдальний перетворювач
        постійного/змінного струму - Аварійний вимикач типу АВР - Зарядний
        пристрій змінного струму (випрямляч) - Стабілізатор напруги мережі
        Джерело безперебійного живлення SINUS генерує напругу з синусоїдою,
        такою ж, як в електромережі. Завдяки цьому він може живити індуктивні
        пристрої (наприклад, електроінструменти, повітряні компресори,
        кондиціонери, холодильники, морозильні камери).
      </div>

      <div className="main-content">
        <ul className="cardboard">
          {converters.map((converter) => (
            <li key={converter.key}>
              <Converter converter={converter} />
            </li>
          ))}
        </ul>
      </div>
    </div>
  );
}

export default Converters;
